In [2]:
import mysql.connector 
#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
  database = "class3_pm"
)
db = database.cursor()

In [4]:
db.execute("SELECT * FROM profile")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 'Kathmandu', '986744567', 1)
(2, 'Shyam', 'Dang', '9845443432', 2)
(3, 'Shyam', 'Dang', '9845443432', 2)
(4, 'nabin', 'Pokhara', '986744533', 2)
(5, 'Sabin', 'Dhading', '986744532', 3)

In [11]:
db.execute("SELECT name FROM profile")
result =db.fetchall()
for x in result:
    print(x)

('Ram Prasad',)
('Sabin',)
('Hari',)
('Krishna',)

In [5]:
db.execute("SELECT * FROM profile WHERE class = 2")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 'Dang', '9845443432', 2)
(3, 'Shyam', 'Dang', '9845443432', 2)
(4, 'nabin', 'Pokhara', '986744533', 2)

In [10]:
db.execute("SELECT * FROM profile WHERE name LIKE '%shyam%'")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 'Dang', '9845443432', 2)
(3, 'Shyam', 'Dang', '9845443432', 2)

In [4]:
sql = "INSERT INTO profile (name,address,phone,class) VALUES('Nabin','Kathmandu','9856554543',2)"
db.execute(sql)
database.commit()

In [5]:
# python -m pip install mysql-connector 

n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    add = input("Enter address = ")
    phone = input("Enter phone = ")
    clas = int(input("Enter class = "))
    
    sql = f"INSERT INTO profile (name,address,phone,class) VALUES('{name}','{add}','{phone}',{clas})"
    db.execute(sql)
database.commit()

Enter n = 2
Enter name = Hari
Enter address = Kathmandu
Enter phone = 9856554509
Enter class = 3
Enter name = Krishna
Enter address = Libali
Enter phone = 9856556543
Enter class = 1

In [6]:
print(sql)

INSERT INTO profile (name,address,phone,class) VALUES('Krishna','Libali','9856556543',1)

In [7]:
sql = "UPDATE profile SET name = 'Ram Prasad' WHERE name = 'Ram'"
db.execute(sql)
database.commit()

In [ ]:
# Update
initial_name = input("Enter initial name = ")
final_name = input("Enter final name = ")
sql = f"UPDATE profile SET name = '{final_name}' WHERE name = '{initial_name}'"
db.execute(sql)
database.commit()

In [10]:
sql = "DELETE FROM profile WHERE address = 'Nepal' or class = 2 "
db.execute(sql)
database.commit()